test/fishUndulation_test/2D/constant/polyMesh/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.3.1                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}

// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

convertToMeters 1;

vertices
(
    (-5  -0.05 -5)
    ( 10 -0.05 -5)
    ( 10  0.05 -5)
    (-5   0.05 -5)
    (-5  -0.05  5)
    ( 10 -0.05  5)
    ( 10  0.05  5)
    (-5   0.05  5)
);

blocks
(
    hex (0 1 2 3 4 5 6 7) (75 1 50) simpleGrading (1 1 1)
);

edges
(
);

boundary
(

    inlet
    {
        type patch;
        faces
        (
            (0 4 7 3)
        );
    }

    outlet
    {
        type patch;
        faces
        (
            (2 6 5 1)
        );
    }

    symFront
    {
        type patch;
        faces
        (
            (1 5 4 0)
        );
    }

    symBack
	{
        type patch;
        faces
        (
            (3 7 6 2)
        );
    }

    topAndBottom
    {
        type patch;
        faces
        (
            (0 3 2 1)
            (4 5 6 7)
        );
    }
);

mergePatchPairs
(
);

// ************************************************************************* //
