test/fishUndulation_test/2D/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  3.0.x                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

6
(
    inlet
    {
        type            patch;
        nFaces          200;
        startFace       239588;
    }
    outlet
    {
        type            patch;
        nFaces          200;
        startFace       239788;
    }
    topAndBottom
    {
        type            patch;
        nFaces          600;
        startFace       239988;
    }
    wing
    {
        type            wall;
        inGroups        1(wall);
        nFaces          686;
        startFace       240588;
    }
    front
    {
        type            empty;
        inGroups        1(empty);
        nFaces          119731;
        startFace       241274;
    }
    back
    {
        type            empty;
        inGroups        1(empty);
        nFaces          119731;
        startFace       361005;
    }
)

// ************************************************************************* //
