test/fishUndulation_test/2D/0/U
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.2.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    location    "0";
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform (0 0 0);

boundaryField
{

	front {
		type			empty;
	}

	back {
		type			empty;
	}
    
    inlet {
        type            fixedValue;
        value           uniform (1 0 0);
    }
    
	outlet {
        type            zeroGradient;
    }
   
	topAndBottom {
		type			slip;
	}

    cylinder
    {
        type            fixedValue;
        value           uniform (0 0 0);
    }
}


// ************************************************************************* //
