test/fishUndulation_test/2D/0/nut
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.2.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      nut;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -1 0 0 0 0];

internalField   uniform 0;

boundaryField
{
    front
    {
        type            empty;
    }

    back
    {
        type            empty;
    }

    inlet
    {
        type            calculated;
		value		    uniform 0;
    }

    outlet
    {
        type            calculated;
	    value    		uniform 0;
    }

    cylinder
    {
        type            nutLowReWallFunction;
		value		    $internalField;
    }

	topAndBottom
	{
		type			slip;
	}
}



// ************************************************************************* //
