test/fishUndulation_test/2D/system/forces
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.1.1                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/

forces
    {
        type                forces;
        functionObjectLibs  ( "libforces.so" );
        outputControl       timeStep;
        outputInterval      1;
        patches             (wing);
        pName               p;
        UName               U;
        rhoName             rhoInf;
        log                 true;
        rhoInf              1;
        CofR                (0 0 0);
    }


// ************************************************************************* //
